Documents/ИзменениеДанных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Document>
		<Properties>
			<Name>ИзменениеДанных</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИмяДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изменил</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Гражданин</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДанныеОГражданине</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/ДанныеОГражданине.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Catalog>
		<Properties>
			<Name>ДанныеОГражданине</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ФИО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Код_СправочникаСотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудник</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Код_СправочникАдрес</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДанныеОбАдресе</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Код_СправочникаПерсональныеДанные</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПерсональныеДанные</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Код_СправочникаСоциальныеДанные</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СоциальныеДанные</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Код_СправочникаДанныеСемьи</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДанныеОСемье</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Код_СправочнниаДанныеОСтране</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДанныеОСтране</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Код_СправочникаНациональности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДанныеОНациональность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Код_СправочникаВопросы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Вопросы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Вопросы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Catalog>
		<Properties>
			<Name>Вопросы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Вопросы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ДанныеОНациональность.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Catalog>
		<Properties>
			<Name>ДанныеОНациональность</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Национальность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПервыйЯзык</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Религия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДругиеЯзыки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ДанныеОСемье.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Catalog>
		<Properties>
			<Name>ДанныеОСемье</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЧленСемьи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусЧленаСемьи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отношение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтепеньРодства</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/СоциальныеДанные.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Catalog>
		<Properties>
			<Name>СоциальныеДанные</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СоциальныйСтатус</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Код_СправочникаОбразование</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДанныеООбразовании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Код_СправочникаРабота</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДанныеОРаботе</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ПерсональныеДанные.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Catalog>
		<Properties>
			<Name>ПерсональныеДанные</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Пол</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Возраст</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БрачныйСтатус</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ДанныеООбразовании.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Catalog>
		<Properties>
			<Name>ДанныеООбразовании</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>УровеньГрамотности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УровеньОбразования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбразовательныеУчреждения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ДанныеОРаботе.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Catalog>
		<Properties>
			<Name>ДанныеОРаботе</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СтатусЭкономическойАктичности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РодЗанятий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Работа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусВозможнойРаботоспособности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Сотрудник.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Catalog>
		<Properties>
			<Name>Сотрудник</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Логин</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Роль</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/ИзменениеДанных/Forms/ФормаИзмененияДанных/Ext/Form/Module.bsl
&НаКлиенте
Процедура Изменить(Команда)
	ИзменитьЗапись(ФИО1);
	Значение = ПроверкаМеню();
	ПараметрыЛогин = Новый Структура("Логин",Логин);
	Если Значение = 0 Тогда
		ОткрытьФорму("ОбщаяФорма.МенюСотрудника",ПараметрыЛогин);
		Закрыть(ЭтаФорма);
	Иначе
		ОткрытьФорму("ОбщаяФорма.МенюАдмина",ПараметрыЛогин);
		Закрыть(ЭтаФорма);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ИзменитьЗапись(ФИОГражданина)
Если ФИО <> "" Тогда 
	Справочник1 = Справочники.ДанныеОГражданине.НайтиПоРеквизиту("ФИО",ФИОГражданина).Ссылка;
	Гражданин_Объект = Справочник1.ПолучитьОбъект();
	Код_Адрес = Справочник1.Код_СправочникАдрес.Код;
	Справочник2 = Справочники.ДанныеОбАдресе.НайтиПоКоду(Код_Адрес).Ссылка;
	Адрес_Объект = Справочник2.ПолучитьОбъект();
	Код_Вопрос = Справочник1.Код_СправочникаВопросы.Код;
	Справочник3 = Справочники.Вопросы.НайтиПоКоду(Код_Вопрос).Ссылка;
	Вопросы_Объект = Справочник3.ПолучитьОбъект();
	Код_Национальность = Справочник1.Код_СправочникаНациональности.Код;
	Справочник4 = Справочники.ДанныеОНациональность.НайтиПоКоду(Код_Национальность).Ссылка;
	Национальность_Объект = Справочник4.ПолучитьОбъект();
	Код_Семья = Справочник1.Код_СправочникаДанныеСемьи.Код;
	Справочник5 = Справочники.ДанныеОСемье.НайтиПоКоду(Код_Семья).Ссылка;
	Семья_Объект = Справочник5.ПолучитьОбъект();
	Код_Страна = Справочник1.Код_СправочнниаДанныеОСтране.Код;
	Справочник6 = Справочники.ДанныеОСтране.НайтиПоКоду(Код_Страна).Ссылка;
	Страна_Объект = Справочник6.ПолучитьОбъект();
	Код_СоцДанные = Справочник1.Код_СправочникаСоциальныеДанные.Код;
	Справочник7 = Справочники.СоциальныеДанные.НайтиПоКоду(Код_СоцДанные).Ссылка;
	СоцДанные_Объект = Справочник7.ПолучитьОбъект();
	Код_ПерДанные = Справочник1.Код_СправочникаПерсональныеДанные.Код;
	Справочник8 = Справочники.ПерсональныеДанные.НайтиПоКоду(Код_ПерДанные).Ссылка;
	ПерДанные_Объект = Справочник8.ПолучитьОбъект();
	Код_Образование = Справочник1.Код_СправочникаСоциальныеДанные.Код_СправочникаОбразование.Код;
	Справочник9 = Справочники.ДанныеООбразовании.НайтиПоКоду(Код_Образование).Ссылка;
	Образование_Объект = Справочник9.ПолучитьОбъект();
	Код_Работа = Справочник1.Код_СправочникаСоциальныеДанные.Код_СправочникаРабота.Код;
	Справочник10 = Справочники.ДанныеОРаботе.НайтиПоКоду(Код_Работа).Ссылка;
	Работа_Объект = Справочник10.ПолучитьОбъект();
	Гражданин_Объект.ФИО = ФИО;
	Адрес_Объект.Область = Область;
	Адрес_Объект.Регион = Регион;
	Адрес_Объект.НаселенныйПункт = НаселенныйПункт;
	Адрес_Объект.Улица = Улица;
	Адрес_Объект.Дом = Дом;
	Адрес_Объект.Строение = Строение;
	Вопросы_Объект.Вопросы = Вопросы;
	Вопросы_Объект.Ответы = Ответы;
	Национальность_Объект.Национальность = Национальность;
	Национальность_Объект.ПервыйЯзык = ПервыйЯзык;
	Национальность_Объект.ДругиеЯзыки = ДругиеЯзыки;
	Национальность_Объект.Религия = Религия;
	Семья_Объект.ЧленСемьи = ЧленСемьи;
	Семья_Объект.СтатусЧленаСемьи = СтатусЧленаСемьи;
	Семья_Объект.Отношение = Отношение;
	Семья_Объект.СтепеньРодства = СтепеньРодства;
	Страна_Объект.Гражданство = Гражданство;
	Страна_Объект.ДатаМиграции = ДатаМиграции;
	Страна_Объект.СтранаРождения = СтранаРождения;
	СоцДанные_Объект.СоциальныйСтатус = СоциальныйСтатус;
	ПерДанные_Объект.Пол = Пол;
	ПерДанные_Объект.Возраст = Возраст;
	ПерДанные_Объект.БрачныйСтатус = БрачныйСтатус;
	Образование_Объект.УровеньГрамотности = УровеньГрамотности;
	Образование_Объект.УровеньОбразования = УровеньОбразования;
	Образование_Объект.ОбразовательныеУчреждения = ОбразовательныеУчреждения;
	Работа_Объект.СтатусЭкономическойАктичности = СтатусЭкономическойАктивности;
	Работа_Объект.СтатусВозможнойРаботоспособности = СтатусВозможнойРаботоспособности;
	Работа_Объект.РодЗанятий = РодЗанятий;
	Работа_Объект.Работа = Работа;
	Работа_Объект.Записать();
	Образование_Объект.Записать();
	СоцДанные_Объект.Записать();
	ПерДанные_Объект.Записать();
	Адрес_Объект.Записать();
	Вопросы_Объект.Записать();
	Национальность_Объект.Записать();
	Страна_Объект.Записать();
	Семья_Объект.Записать();
	Гражданин_Объект.Записать();
Иначе
	Сообщить("Заполните все поля");
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура Меню(Команда)
	Значение = ПроверкаМеню();
	ПараметрыЛогин = Новый Структура("Логин",Логин);
	Если Значение = 0 Тогда
		ОткрытьФорму("ОбщаяФорма.МенюСотрудника",ПараметрыЛогин);
		Закрыть(ЭтаФорма);
	Иначе
		ОткрытьФорму("ОбщаяФорма.МенюАдмина",ПараметрыЛогин);
		Закрыть(ЭтаФорма);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПроверкаМеню()
	Пользователь = Справочники.Сотрудник.НайтиПоРеквизиту("Логин",Логин).Роль;
	Если Пользователь = Ложь Тогда
		Возврат 0;
	Иначе
		Возврат 1;
	КонецЕсли;
КонецФункции

&НаСервере
 Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	 Логин = Параметры.Логин;
 КонецПроцедуры


&НаКлиенте
 Процедура НайтиДанные(Команда)
	 Перем ФИОГражданина;
	 ФИОГражданина = ПоискФИО;
	 ФИО1 = ПоискФИО;
	 НайтиНаСервере(ФИОГражданина); 
 КонецПроцедуры
 
&НаСервере
Функция НайтиНаСервере(ФИОГражданина)
	Справочник1 = Справочники.ДанныеОГражданине.НайтиПоРеквизиту("ФИО",ФИОГражданина).Ссылка;
	Если Не Справочники.ДанныеОГражданине.НайтиПоРеквизиту("ФИО",ФИОГражданина).Пустая() Тогда
		ФИО = Справочник1.ФИО;
		Область = Справочник1.Код_СправочникАдрес.Область;
		Регион = Справочник1.Код_СправочникАдрес.Регион;
		НаселенныйПункт = Справочник1.Код_СправочникАдрес.НаселенныйПункт;
		Улица = Справочник1.Код_СправочникАдрес.Улица;
		Дом = Справочник1.Код_СправочникАдрес.Дом;
		Строение = Справочник1.Код_СправочникАдрес.Строение;
		СтранаРождения = Справочник1.Код_СправочнниаДанныеОСтране.СтранаРождения;
		ДатаМиграции = Справочник1.Код_СправочнниаДанныеОСтране.ДатаМиграции;
		Гражданство = Справочник1.Код_СправочнниаДанныеОСтране.Гражданство;
		Вопросы = Справочник1.Код_СправочникаВопросы.Вопросы;
		Ответы = Справочник1.Код_СправочникаВопросы.Ответы;
		УровеньГрамотности = Справочник1.Код_СправочникаСоциальныеДанные.Код_СправочникаОбразование.УровеньГрамотности;
		УровеньОбразования = Справочник1.Код_СправочникаСоциальныеДанные.Код_СправочникаОбразование.УровеньОбразования;
		ОбразовательныеУчреждения = Справочник1.Код_СправочникаСоциальныеДанные.Код_СправочникаОбразование.ОбразовательныеУчреждения;
		СоциальныйСтатус = Справочник1.Код_СправочникаСоциальныеДанные.СоциальныйСтатус;
		Пол = Справочник1.Код_СправочникаПерсональныеДанные.Пол;
		Возраст = Справочник1.Код_СправочникаПерсональныеДанные.Возраст;
		БрачныйСтатус = Справочник1.Код_СправочникаПерсональныеДанные.БрачныйСтатус;
		Национальность = Справочник1.Код_СправочникаНациональности.Национальность;
		ПервыйЯзык = Справочник1.Код_СправочникаНациональности.ПервыйЯзык;
		ДругиеЯзыки = Справочник1.Код_СправочникаНациональности.ДругиеЯзыки;
		Религия = Справочник1.Код_СправочникаНациональности.Религия;
		СтатусЭкономическойАктивности = Справочник1.Код_СправочникаСоциальныеДанные.Код_СправочникаРабота.СтатусЭкономическойАктичности;
		РодЗанятий = Справочник1.Код_СправочникаСоциальныеДанные.Код_СправочникаРабота.РодЗанятий;
		Работа = Справочник1.Код_СправочникаСоциальныеДанные.Код_СправочникаРабота.Работа;
		СтатусВозможнойРаботоспособности = Справочник1.Код_СправочникаСоциальныеДанные.Код_СправочникаРабота.СтатусВозможнойРаботоспособности;
		ЧленСемьи = Справочник1.Код_СправочникаДанныеСемьи.ЧленСемьи;
		СтатусЧленаСемьи = Справочник1.Код_СправочникаДанныеСемьи.СтатусЧленаСемьи;
		Отношение = Справочник1.Код_СправочникаДанныеСемьи.Отношение;
		СтепеньРодства = Справочник1.Код_СправочникаДанныеСемьи.СтепеньРодства;
	Иначе
		ФИО = "";
		Область = "";
		Регион = "";
		НаселенныйПункт = "";
		Улица = "";
		Дом = "";
		Строение = "";
		СтранаРождения = "";
		ДатаМиграции = Неопределено;
		Гражданство = "";
		Вопросы = "";
		Ответы = "";
		УровеньГрамотности = "";
		УровеньОбразования = "";
		ОбразовательныеУчреждения = "";
		СоциальныйСтатус = "";
		Возраст = "";
		БрачныйСтатус = "";
		Национальность = "";
		ПервыйЯзык = "";
		ДругиеЯзыки = "";
		Религия = "";
		СтатусЭкономическойАктивности = "";
		РодЗанятий = "";
		Работа = "";
		СтатусВозможнойРаботоспособности = "";
		ЧленСемьи = "";
		СтатусЧленаСемьи = "";
		Отношение = "";
		СтепеньРодства = "";
		СтатусПоиска = "Не найдено!";
	КонецЕсли;
КонецФункции


&НаКлиенте
Процедура Выход(Команда)
	Перем ЗакрытиеОкна;
	Попытка
	 ЗакрытиеОкон = ПолучитьОкна();
	Для Каждого Элемент Из ЗакрытиеОкон Цикл
    	Если Не Элемент.Основное Тогда
        	Форма = Элемент.ПолучитьСодержимое();
        	Форма.Закрыть();
    	КонецЕсли;
	КонецЦикла;
	Исключение
	КонецПопытки;
КонецПроцедуры
